tutorials/fluidisedBed2D/fluidisedBed2D/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

initialSpeed 0.2; //metres/sec

internalField   uniform (0  0 0);

boundaryField
{

    inlet
    {
        type               interstitialInletVelocity;
        inletVelocity      uniform (0 0 $initialSpeed);
        alpha              alpha.air;
        value              $internalField;
    }

    outlet
    {
        type               pressureInletOutletVelocity;
        phi                phi.air;
        value              $internalField;
    }

    walls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type               noSlip;
    }
}

// ************************************************************************* //
