tutorials/fluidisedBed2D/fluidisedBed2D/0/alpha.particles.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    inlet
    {
        type               zeroGradient;
    }

    outlet
    {
        //- If a particle leaves it leaves for good
        type            inletOutlet;
        phi             phi.particles;
        inletValue      uniform 0;
        value           uniform 0;

    }

    walls
    {
        type               zeroGradient;
    }

    frontAndBack
    {
        type               zeroGradient;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
